# IMDB CSV file in MYSQLite
### NUPRIYA saxena
#### Internship -34
##### Batch-DS0622

# capstone project
### Mysqlite data

<b>Make two tables and corresponding columns provided in the above CSV files in SQLite.Insert all data of each CSV file in each of the created tables. Now start querying the table(s) in the SQLite database :<b>

In [117]:
# Import required modules
import csv
import sqlite3

In [118]:
# Connecting to the database
connection = sqlite3.connect('IMDB.db')

In [119]:
# Creating a cursor object to execute
# SQL queries on a database table
cursor = connection.cursor()

In [23]:
# Table Definition
createtable = '''CREATE TABLE firstData(Sno int ,
                movie_Name text PRIMARY KEY ,
                Director_name text ,
                Run_Time text ,
                Year int ,
                Ratings float ,
                metascore int);
                '''

In [ ]:
# Creating the table into our
# database
cursor.execute(createtable)

In [120]:
# Opening the firstdata-records.csv file
firstfile = open('firstdata.csv')

In [121]:
# Reading the contents of the
# firstdata-records.csv file
contents = csv.reader(firstfile)

In [6]:
# SQL query to insert data into the
# firstdata table
insert_records = "INSERT INTO firstdata (Sno ,movie_Name , Director_name ,Run_Time ,Year , Ratings , metascore ) VALUES(?, ? , ?,?,?,?,?)"

In [ ]:
# Importing the contents of the file
# into our firstdata table
cursor.executemany(insert_records, contents)

In [122]:
# SQL query to retrieve all data from
# the firstdata table To verify that the
# data of the csv file has been successfully
# inserted into the table
select_all = "SELECT * FROM firstdata"
rows = cursor.execute(select_all).fetchall()

In [123]:
# Output to the console screen
for r in rows:
    print(r)

('Sno', ' movie_Name', 'Director_name', ' Run_Time', 'Year', 'Ratings', 'metascore')
(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84)
(2, 'The Lord of the Rings: The Return of the King', 'Lilly Wachowski', '201 min', '(2003)', 9.0, 94)
(3, 'Inception', 'Keanu Reeves', '148 min', '(2010)', 8.8, 74)
(4, 'The Lord of the Rings: The Fellowship of the Ring', 'Laurence Fishburne', '178 min', '(2001)', 8.8, 92)
(5, 'The Lord of the Rings: The Two Towers', 'Carrie-Anne Moss', '179 min', '(2002)', 8.8, 87)
(6, 'The Matrix', 'Hugo Weaving', '136 min', '(1999)', 8.7, 73)

In [124]:
# Committing the changes
connection.commit()

# Q1)  Display all the details of movies created by directors Christopher and Matt Reeves.

In [125]:
results=cursor.execute("select * from firstdata")

for i in results:
    print(i)

('Sno', ' movie_Name', 'Director_name', ' Run_Time', 'Year', 'Ratings', 'metascore')
(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84)
(2, 'The Lord of the Rings: The Return of the King', 'Lilly Wachowski', '201 min', '(2003)', 9.0, 94)
(3, 'Inception', 'Keanu Reeves', '148 min', '(2010)', 8.8, 74)
(4, 'The Lord of the Rings: The Fellowship of the Ring', 'Laurence Fishburne', '178 min', '(2001)', 8.8, 92)
(5, 'The Lord of the Rings: The Two Towers', 'Carrie-Anne Moss', '179 min', '(2002)', 8.8, 87)
(6, 'The Matrix', 'Hugo Weaving', '136 min', '(1999)', 8.7, 73)

In [126]:
results=cursor.execute('select * from firstdata where Director_name in("Christopher","Matt Reeves")')

for i in results:
    print(i)

# Q2) Display all the details of movies with a duration of 140 minutes to 190 minutes.

In [11]:
results=cursor.execute('select * from firstdata where Run_Time between 140 and 190')

for i in results:
    print(i)

(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84)
(3, 'Inception', 'Keanu Reeves', '148 min', '(2010)', 8.8, 74)
(4, 'The Lord of the Rings: The Fellowship of the Ring', 'Laurence Fishburne', '178 min', '(2001)', 8.8, 92)
(5, 'The Lord of the Rings: The Two Towers', 'Carrie-Anne Moss', '179 min', '(2002)', 8.8, 87)

# Q3) Display all details of movies with ratings above 7 in ascending order.

In [12]:
results=cursor.execute('select * from firstdata where Ratings >7' and ('select * from firstdata order by Ratings asc'))

for i in results:
    print(i)

(6, 'The Matrix', 'Hugo Weaving', '136 min', '(1999)', 8.7, 73)
(3, 'Inception', 'Keanu Reeves', '148 min', '(2010)', 8.8, 74)
(4, 'The Lord of the Rings: The Fellowship of the Ring', 'Laurence Fishburne', '178 min', '(2001)', 8.8, 92)
(5, 'The Lord of the Rings: The Two Towers', 'Carrie-Anne Moss', '179 min', '(2002)', 8.8, 87)
(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84)
(2, 'The Lord of the Rings: The Return of the King', 'Lilly Wachowski', '201 min', '(2003)', 9.0, 94)
('Sno', ' movie_Name', 'Director_name', ' Run_Time', 'Year', 'Ratings', 'metascore')

# Q4) Display all movie names in descending order.

In [13]:
results=cursor.execute('select movie_Name from firstdata order by movie_Name asc')

for i in results:
    print(i)

(' movie_Name',)
('Inception',)
('The Dark Knight',)
('The Lord of the Rings: The Fellowship of the Ring',)
('The Lord of the Rings: The Return of the King',)
('The Lord of the Rings: The Two Towers',)
('The Matrix',)

# Q5) Display movie name starts with ‘P’ and their rating is greater than 7.

In [14]:
results=cursor.execute("select movie_Name from firstdata where movie_Name like 'P%'" or "select movie_Name from firstdata where Ratings>7")

for i in results:
    print(i)

# Table 2 querys

In [15]:
# Import required modules
import csv
import sqlite3

In [16]:
# Connecting to the database
connection = sqlite3.connect('IMDB.db')

In [17]:
# Creating a cursor object to execute
# SQL queries on a database table
cursor = connection.cursor()

In [41]:
# Table Definition
create_table = '''CREATE TABLE seconddata(
                 Movie_Name text,
                Stars text,
                Votes int,
                Genre text,
                Gross_collection int,
                Certification text,
                FOREIGN KEY ( Movie_Name) REFERENCES firstdata(movie_Name));
                '''

In [42]:
# Creating the table into our
# database
cursor.execute(create_table)

In [18]:
# Opening the seconddata-records.csv file
file2 = open('seconddata.csv')

In [19]:
# Reading the contents of the
# seconddata.csv file
contents = csv.reader(file2)

In [45]:
# SQL query to insert data into the
# person table
insert_records = "INSERT INTO seconddata ( Movie_Name, Stars,Votes,Genre,Gross_collection,Certification) VALUES(?, ?,?,?,?,?)"

In [46]:
# Importing the contents of the file
# into our seconddata table
cursor.executemany(insert_records, contents)

In [20]:
# SQL query to retrieve all data from
# the seconddata table To verify that the
# data of the csv file has been successfully
# inserted into the table
select_all = "SELECT * FROM seconddata"
rows = cursor.execute(select_all).fetchall()

In [21]:
# Output to the console screen
for r in rows:
    print(r)

(' Movie_Name', 'Stars', 'Votes', 'Genre', 'Gross_collection', 'Certification')
('Spider-Man: Across the Spider-Verse', 'Joaquim Dos Santos', '39,184', 'Animation, Action, Adventure', '$534.86M', 'PG')
('The Dark Knight', 'Kemp Powers', '2,719,653', 'Action, Crime, Drama', '$377.85M', 'PG-13')
('The Lord of the Rings: The Return of the King', 'Justin K. Thompson', '1,887,936', 'Action, Adventure, Drama', '$292.58M', 'PG-13')
('Inception', 'Shameik Moore', '2,414,227', 'Action, Adventure, Sci-Fi', '$315.54M', 'PG-13')
('The Lord of the Rings: The Fellowship of the Ring', 'Hailee Steinfeld', '1,916,556', 'Action, Adventure, Drama', '$342.55M', 'PG-13')

In [22]:
# Committing the changes
connection.commit()

# Q1) Display all movie names with star Arnold Schwarzenegger in ascending order.

In [23]:
results=cursor.execute("select  Movie_Name from seconddata where Stars in('Arnold Schwarzenegger') order by  Movie_Name asc")

for i in results:
    print(i)

# Q2 Display all details of the movie with the highest number of votes.

In [24]:
results=cursor.execute("SELECT * FROM seconddata" and "SELECT MIN(Votes) FROM seconddata")

for i in results:
    print(i)

('1,887,936',)

# Q3) Display movie names with gross collections in descending order.

In [25]:
results=cursor.execute("SELECT * FROM seconddata ORDER BY Gross_collection DESC")

for i in results:
    print(i)

(' Movie_Name', 'Stars', 'Votes', 'Genre', 'Gross_collection', 'Certification')
('Spider-Man: Across the Spider-Verse', 'Joaquim Dos Santos', '39,184', 'Animation, Action, Adventure', '$534.86M', 'PG')
('The Dark Knight', 'Kemp Powers', '2,719,653', 'Action, Crime, Drama', '$377.85M', 'PG-13')
('The Lord of the Rings: The Fellowship of the Ring', 'Hailee Steinfeld', '1,916,556', 'Action, Adventure, Drama', '$342.55M', 'PG-13')
('Inception', 'Shameik Moore', '2,414,227', 'Action, Adventure, Sci-Fi', '$315.54M', 'PG-13')
('The Lord of the Rings: The Return of the King', 'Justin K. Thompson', '1,887,936', 'Action, Adventure, Drama', '$292.58M', 'PG-13')

# Q4) Display the gross collection of movies with the star Arnold.

In [26]:
results=cursor.execute("SELECT Gross_collection FROM seconddata WHERE Stars=('Arnold')")

for i in results:
    print(i)

# Q5) Display all details of movies with comedy and action genres.

In [27]:
sql=cursor.execute("SELECT * FROM seconddata WHERE Genre in ('Action','Comedy')")

for i in results:
    print(i)

# Make subquery :

# Q1) Display all details from both tables where movie names are the same.

In [102]:
# Import required modules
import csv
import sqlite3

In [103]:
# Connecting to the database
connection = sqlite3.connect('IMDB.db')

In [104]:
# Creating a cursor object to execute
# SQL queries on a database table
cursor = connection.cursor()

In [31]:
sql=cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , firstdata.Ratings , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , seconddata.Gross_collection , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name")

result = cursor.fetchall()
for i in result:
    print(i)

(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84, 'Kemp Powers', '2,719,653', 'Action, Crime, Drama', '$377.85M', 'PG-13')
(2, 'The Lord of the Rings: The Return of the King', 'Lilly Wachowski', '201 min', '(2003)', 9.0, 94, 'Justin K. Thompson', '1,887,936', 'Action, Adventure, Drama', '$292.58M', 'PG-13')
(3, 'Inception', 'Keanu Reeves', '148 min', '(2010)', 8.8, 74, 'Shameik Moore', '2,414,227', 'Action, Adventure, Sci-Fi', '$315.54M', 'PG-13')
(4, 'The Lord of the Rings: The Fellowship of the Ring', 'Laurence Fishburne', '178 min', '(2001)', 8.8, 92, 'Hailee Steinfeld', '1,916,556', 'Action, Adventure, Drama', '$342.55M', 'PG-13')

# Q2)   Display all movie names, Director, ratings, and gross collection where the genre is action.

In [32]:
sql=cursor.execute("SELECT firstdata.movie_name , firstdata.Director_name , firstdata.Ratings , seconddata.Gross_collection from firstdata INNER JOIN seconddata WHERE Genre in ('Action')")

result = cursor.fetchall()
for i in result:
    print(i)

# Q3)Display all details from both tables with the highest gross collection.

In [33]:
sql=cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , firstdata.Ratings , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , MAX(seconddata.Gross_collection) , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name")

result = cursor.fetchall()
for i in result:
    print(i)

(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84, 'Kemp Powers', '2,719,653', 'Action, Crime, Drama', '$377.85M', 'PG-13')

# Q4)Display all details from both tables with the highest ratings

In [34]:
sql=cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , MAX(firstdata.Ratings) , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , seconddata.Gross_collection , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name")

result = cursor.fetchall()
for i in result:
    print(i)

(1, 'The Dark Knight', 'Lana Wachowski', '152 min', '(2008)', 9.0, 84, 'Kemp Powers', '2,719,653', 'Action, Crime, Drama', '$377.85M', 'PG-13')

# Q5)Display all details from both tables with the lowest gross collection and lowest ratings

In [35]:
sql=cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , MIN(firstdata.Ratings) , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , MIN(seconddata.Gross_collection) , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name")

result = cursor.fetchall()
for i in result:
    print(i)

(2, 'The Lord of the Rings: The Return of the King', 'Lilly Wachowski', '201 min', '(2003)', 8.8, 94, 'Justin K. Thompson', '1,887,936', 'Action, Adventure, Drama', '$292.58M', 'PG-13')

# Now once completed with queries in the SQLite database, then make the exact query solutions by using PANDAS SQL in the data frame.Load the CSV data in a data frame and start making solutions for all the above 15 queries using PANDAS SQL. You may use concat or merge joins per the requirements basis to make 5 join queries.

#  <u><b>TABLE 1<b><u>

In [36]:
import pandas as pd

data = pd.read_csv (r'C:\Users\dell\firstdata.csv')   
df = pd.DataFrame(data)

print(df)

   Sno                                         movie_Name    Director_name  \
0  1.0                Spider-Man: Across the Spider-Verse    Peter Jackson
1  2.0                                    The Dark Knight      Elijah Wood
2  3.0      The Lord of the Rings: The Return of the King     Ian McKellen
3  4.0                                          Inception  Viggo Mortensen
4  5.0  The Lord of the Rings: The Fellowship of the Ring    Orlando Bloom

   Run_Time    Year  Ratings  metascore
0   140 min  (2023)      9.1         86
1   152 min  (2008)      9.0         84
2   201 min  (2003)      9.0         94
3   148 min  (2010)      8.8         74
4   178 min  (2001)      8.8         92

In [47]:
# Connecting to the database
connection = sqlite3.connect('IMDB.db')

In [48]:
# Creating a cursor object to execute
# SQL queries on a database table
cursor = connection.cursor()

In [54]:
#creating dataframe
firstdata=pd.DataFrame(cursor.execute('select * from firstdata'))
print('\033[1m'+'The first CSV file data contains  :'+'\033[0m')
firstdata

The first CSV file data contains  :

,0,1,2,3,4,5,6
0,Sno,movie_Name,Director_name,Run_Time,Year,Ratings,metascore
1,1,The Dark Knight,Lana Wachowski,152 min,(2008),9.0,84
2,2,The Lord of the Rings: The Return of the King,Lilly Wachowski,201 min,(2003),9.0,94
3,3,Inception,Keanu Reeves,148 min,(2010),8.8,74
4,4,The Lord of the Rings: The Fellowship of the Ring,Laurence Fishburne,178 min,(2001),8.8,92
5,5,The Lord of the Rings: The Two Towers,Carrie-Anne Moss,179 min,(2002),8.8,87
6,6,The Matrix,Hugo Weaving,136 min,(1999),8.7,73

# Q1) Display all the details of movies created by directors Christopher and Matt Reeves.

In [66]:
#creating dataframe
firstdata=pd.DataFrame(cursor.execute('select * from firstdata where Director_name in("Christopher","Matt Reeves")'))
print('\033[1m'+'The first CSV file data contains  :'+'\033[0m')
firstdata

The first CSV file data contains  :

Empty DataFrame
Columns: []
Index: []

# Q2) Display all the details of movies with a duration of 140 minutes to 190 minutes.

In [67]:
#creating dataframe
firstdata=pd.DataFrame(cursor.execute('select * from firstdata where Run_Time between 140 and 190'))
print('\033[1m'+'The first CSV file data contains  :'+'\033[0m')
firstdata

The first CSV file data contains  :

,0,1,2,3,4,5,6
0,1,The Dark Knight,Lana Wachowski,152 min,(2008),9.0,84
1,3,Inception,Keanu Reeves,148 min,(2010),8.8,74
2,4,The Lord of the Rings: The Fellowship of the Ring,Laurence Fishburne,178 min,(2001),8.8,92
3,5,The Lord of the Rings: The Two Towers,Carrie-Anne Moss,179 min,(2002),8.8,87

# Q3) Display all details of movies with ratings above 7 in ascending order.

In [69]:


#creating dataframe
firstdata=pd.DataFrame(cursor.execute('select * from firstdata where Ratings >7' and ('select * from firstdata order by Ratings asc')))
print('\033[1m'+'The first CSV file data contains  :'+'\033[0m')
firstdata

The first CSV file data contains  :

,0,1,2,3,4,5,6
0,6,The Matrix,Hugo Weaving,136 min,(1999),8.7,73
1,3,Inception,Keanu Reeves,148 min,(2010),8.8,74
2,4,The Lord of the Rings: The Fellowship of the Ring,Laurence Fishburne,178 min,(2001),8.8,92
3,5,The Lord of the Rings: The Two Towers,Carrie-Anne Moss,179 min,(2002),8.8,87
4,1,The Dark Knight,Lana Wachowski,152 min,(2008),9.0,84
5,2,The Lord of the Rings: The Return of the King,Lilly Wachowski,201 min,(2003),9.0,94
6,Sno,movie_Name,Director_name,Run_Time,Year,Ratings,metascore

# Q4) Display all movie names in descending order.

In [70]:
#creating dataframe
firstdata=pd.DataFrame(cursor.execute('select movie_Name from firstdata order by movie_Name asc'))
print('\033[1m'+'The first CSV file data contains  :'+'\033[0m')
firstdata

The first CSV file data contains  :

                                                   0
0                                         movie_Name
1                                          Inception
2                                    The Dark Knight
3  The Lord of the Rings: The Fellowship of the Ring
4      The Lord of the Rings: The Return of the King
5              The Lord of the Rings: The Two Towers
6                                         The Matrix

# Q5) Display movie name starts with ‘P’ and their rating is greater than 7.

In [71]:
#creating dataframe
firstdata=pd.DataFrame(cursor.execute("select movie_Name from firstdata where movie_Name like 'P%'" or "select movie_Name from firstdata where Ratings>7"))
print('\033[1m'+'The first CSV file data contains  :'+'\033[0m')
firstdata

The first CSV file data contains  :

Empty DataFrame
Columns: []
Index: []

# <u><b>Table 2 querys<b><u>

In [72]:
import pandas as pd

data = pd.read_csv (r'C:\Users\dell\seconddata.csv')   
df = pd.DataFrame(data)

print(df)

                                          Movie_Name               Stars  \
0                Spider-Man: Across the Spider-Verse  Joaquim Dos Santos
1                                    The Dark Knight         Kemp Powers
2      The Lord of the Rings: The Return of the King  Justin K. Thompson
3                                          Inception       Shameik Moore
4  The Lord of the Rings: The Fellowship of the Ring    Hailee Steinfeld

       Votes                         Genre Gross_collection Certification
0     51,087  Animation, Action, Adventure         $534.86M            PG
1  2,719,963          Action, Crime, Drama         $377.85M         PG-13
2  1,888,122      Action, Adventure, Drama         $292.58M         PG-13
3  2,414,468     Action, Adventure, Sci-Fi         $315.54M         PG-13
4  1,916,733      Action, Adventure, Drama         $342.55M         PG-13

In [73]:
# Connecting to the database
connection = sqlite3.connect('IMDB.db')

In [74]:
# Creating a cursor object to execute
# SQL queries on a database table
cursor = connection.cursor()

In [80]:
#creating dataframe
seconddata=pd.DataFrame(cursor.execute('select * from seconddata'))
print('\033[1m'+'The second CSV file data contains  :'+'\033[0m')
seconddata

The second CSV file data contains  :

,0,1,2,3,4,5
0,Movie_Name,Stars,Votes,Genre,Gross_collection,Certification
1,Spider-Man: Across the Spider-Verse,Joaquim Dos Santos,"39,184","Animation, Action, Adventure",$534.86M,PG
2,The Dark Knight,Kemp Powers,"2,719,653","Action, Crime, Drama",$377.85M,PG-13
3,The Lord of the Rings: The Return of the King,Justin K. Thompson,"1,887,936","Action, Adventure, Drama",$292.58M,PG-13
4,Inception,Shameik Moore,"2,414,227","Action, Adventure, Sci-Fi",$315.54M,PG-13
5,The Lord of the Rings: The Fellowship of the Ring,Hailee Steinfeld,"1,916,556","Action, Adventure, Drama",$342.55M,PG-13

# Q1) Display all movie names with star Arnold Schwarzenegger in ascending order.

In [81]:
#creating dataframe
seconddata=pd.DataFrame(cursor.execute("select  Movie_Name from seconddata where Stars in('Arnold Schwarzenegger') order by  Movie_Name asc"))
print('\033[1m'+'The second CSV file data contains  :'+'\033[0m')
seconddata

The second CSV file data contains  :

Empty DataFrame
Columns: []
Index: []

# Q2 Display all details of the movie with the highest number of votes.

In [82]:
#creating dataframe
seconddata=pd.DataFrame(cursor.execute("SELECT * FROM seconddata" and "SELECT MIN(Votes) FROM seconddata"))
print('\033[1m'+'The second CSV file data contains  :'+'\033[0m')
seconddata

The second CSV file data contains  :

           0
0  1,887,936

# Q3) Display movie names with gross collections in descending order.

In [83]:
#creating dataframe
seconddata=pd.DataFrame(cursor.execute("SELECT * FROM seconddata ORDER BY Gross_collection DESC"))
print('\033[1m'+'The second CSV file data contains  :'+'\033[0m')
seconddata

The second CSV file data contains  :

,0,1,2,3,4,5
0,Movie_Name,Stars,Votes,Genre,Gross_collection,Certification
1,Spider-Man: Across the Spider-Verse,Joaquim Dos Santos,"39,184","Animation, Action, Adventure",$534.86M,PG
2,The Dark Knight,Kemp Powers,"2,719,653","Action, Crime, Drama",$377.85M,PG-13
3,The Lord of the Rings: The Fellowship of the Ring,Hailee Steinfeld,"1,916,556","Action, Adventure, Drama",$342.55M,PG-13
4,Inception,Shameik Moore,"2,414,227","Action, Adventure, Sci-Fi",$315.54M,PG-13
5,The Lord of the Rings: The Return of the King,Justin K. Thompson,"1,887,936","Action, Adventure, Drama",$292.58M,PG-13

# Q4) Display the gross collection of movies with the star Arnold.

In [84]:
#creating dataframe
seconddata=pd.DataFrame(cursor.execute("SELECT Gross_collection FROM seconddata WHERE Stars=('Arnold')"))
print('\033[1m'+'The second CSV file data contains  :'+'\033[0m')
seconddata

The second CSV file data contains  :

Empty DataFrame
Columns: []
Index: []

# Q5) Display all details of movies with comedy and action genres.

In [85]:

#creating dataframe
seconddata=pd.DataFrame(cursor.execute("SELECT * FROM seconddata WHERE Genre in ('Action','Comedy')"))
print('\033[1m'+'The second CSV file data contains  :'+'\033[0m')
seconddata

The second CSV file data contains  :

Empty DataFrame
Columns: []
Index: []

# <u><b>Make subquery :<b><u>

In [95]:
df=pd.read_csv("firstdata.csv")
df

,Sno,movie_Name,Director_name,Run_Time,Year,Ratings,metascore
0,1.0,Spider-Man: Across the Spider-Verse,Peter Jackson,140 min,(2023),9.1,86
1,2.0,The Dark Knight,Elijah Wood,152 min,(2008),9.0,84
2,3.0,The Lord of the Rings: The Return of the King,Ian McKellen,201 min,(2003),9.0,94
3,4.0,Inception,Viggo Mortensen,148 min,(2010),8.8,74
4,5.0,The Lord of the Rings: The Fellowship of the Ring,Orlando Bloom,178 min,(2001),8.8,92

In [96]:
dfdetail=pd.read_csv("seconddata.csv")
dfdetail

,movie_Name,Stars,Votes,Genre,Gross_collection,Certification
0,Spider-Man: Across the Spider-Verse,Joaquim Dos Santos,"52,831","Animation, Action, Adventure",$534.86M,PG
1,The Dark Knight,Kemp Powers,"2,720,209","Action, Crime, Drama",$377.85M,PG-13
2,The Lord of the Rings: The Return of the King,Justin K. Thompson,"1,888,226","Action, Adventure, Drama",$292.58M,PG-13
3,Inception,Shameik Moore,"2,414,641","Action, Adventure, Sci-Fi",$315.54M,PG-13
4,The Lord of the Rings: The Fellowship of the Ring,Hailee Steinfeld,"1,916,841","Action, Adventure, Drama",$342.55M,PG-13

In [98]:
dfall = pd.merge(df, dfdetail, how='inner', on = 'movie_Name')

In [99]:
dfall

,Sno,movie_Name,Director_name,Run_Time,Year,Ratings,metascore,Stars,Votes,Genre,Gross_collection,Certification
0,1.0,Spider-Man: Across the Spider-Verse,Peter Jackson,140 min,(2023),9.1,86,Joaquim Dos Santos,"52,831","Animation, Action, Adventure",$534.86M,PG
1,2.0,The Dark Knight,Elijah Wood,152 min,(2008),9.0,84,Kemp Powers,"2,720,209","Action, Crime, Drama",$377.85M,PG-13
2,3.0,The Lord of the Rings: The Return of the King,Ian McKellen,201 min,(2003),9.0,94,Justin K. Thompson,"1,888,226","Action, Adventure, Drama",$292.58M,PG-13
3,4.0,Inception,Viggo Mortensen,148 min,(2010),8.8,74,Shameik Moore,"2,414,641","Action, Adventure, Sci-Fi",$315.54M,PG-13
4,5.0,The Lord of the Rings: The Fellowship of the Ring,Orlando Bloom,178 min,(2001),8.8,92,Hailee Steinfeld,"1,916,841","Action, Adventure, Drama",$342.55M,PG-13

# Q1) Display all details from both tables where movie names are the same.

In [116]:
#creating dataframe
dall=pd.DataFrame(cursor.execute('SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , firstdata.Ratings , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , seconddata.Gross_collection , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name'))
print('\033[1m'+'The join CSV file data contains  :'+'\033[0m')
dall

The join CSV file data contains  :

,0,1,2,3,4,5,6,7,8,9,10,11
0,1,The Dark Knight,Lana Wachowski,152 min,(2008),9.0,84,Kemp Powers,"2,719,653","Action, Crime, Drama",$377.85M,PG-13
1,2,The Lord of the Rings: The Return of the King,Lilly Wachowski,201 min,(2003),9.0,94,Justin K. Thompson,"1,887,936","Action, Adventure, Drama",$292.58M,PG-13
2,3,Inception,Keanu Reeves,148 min,(2010),8.8,74,Shameik Moore,"2,414,227","Action, Adventure, Sci-Fi",$315.54M,PG-13
3,4,The Lord of the Rings: The Fellowship of the Ring,Laurence Fishburne,178 min,(2001),8.8,92,Hailee Steinfeld,"1,916,556","Action, Adventure, Drama",$342.55M,PG-13

# Q2) Display all movie names, Director, ratings, and gross collection where the genre is action.

In [115]:
#creating dataframe
dall=pd.DataFrame(cursor.execute("SELECT firstdata.movie_name , firstdata.Director_name , firstdata.Ratings , seconddata.Gross_collection from firstdata INNER JOIN seconddata WHERE Genre in ('Action')"))
print('\033[1m'+'The join CSV file data contains  :'+'\033[0m')
dall

The join CSV file data contains  :

Empty DataFrame
Columns: []
Index: []

# Q3)Display all details from both tables with the highest gross collection.

In [114]:
#creating dataframe
dall=pd.DataFrame(cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , firstdata.Ratings , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , MAX(seconddata.Gross_collection) , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name"))
print('\033[1m'+'The join CSV file data contains  :'+'\033[0m')
dall

The join CSV file data contains  :

,0,1,2,3,4,5,6,7,8,9,10,11
0,1,The Dark Knight,Lana Wachowski,152 min,(2008),9.0,84,Kemp Powers,"2,719,653","Action, Crime, Drama",$377.85M,PG-13

# Q4)      Display all details from both tables with the highest ratings

In [113]:
#creating dataframe
dall=pd.DataFrame(cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , MAX(firstdata.Ratings) , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , seconddata.Gross_collection , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name"))
print('\033[1m'+'The join CSV file data contains  :'+'\033[0m')
dall

The join CSV file data contains  :

,0,1,2,3,4,5,6,7,8,9,10,11
0,1,The Dark Knight,Lana Wachowski,152 min,(2008),9.0,84,Kemp Powers,"2,719,653","Action, Crime, Drama",$377.85M,PG-13

# Q5)      Display all details from both tables with the lowest gross collection and lowest ratings

In [112]:
#creating dataframe
dall=pd.DataFrame(cursor.execute("SELECT firstdata.Sno ,firstdata.movie_name, firstdata.Director_name , firstdata.Run_Time , firstdata.Year , MIN(firstdata.Ratings) , firstdata.metascore , seconddata.Stars , seconddata.Votes ,seconddata.Genre , MIN(seconddata.Gross_collection) , seconddata.Certification FROM firstdata INNER JOIN seconddata ON firstdata.movie_Name=seconddata.Movie_Name"))
print('\033[1m'+'The join CSV file data contains  :'+'\033[0m')
dall

The join CSV file data contains  :

,0,1,2,3,4,5,6,7,8,9,10,11
0,2,The Lord of the Rings: The Return of the King,Lilly Wachowski,201 min,(2003),8.8,94,Justin K. Thompson,"1,887,936","Action, Adventure, Drama",$292.58M,PG-13